package com.johnpank.chapter8;

import com.johnpank.chapter8.models.Client;

import java.util.Calendar;
import java.util.Date;

public class ClientGenerator {

    static final String[] names = new String[]{ "Виктория", "Елена", "Ирина", "Ольга", "Татьяна",
            "Каролина", "Наталья", "Светлана", "Иль", "Анастасия", "Анна", "Галина", "Екатерина", "Людмила",
            "Марина", "Мария", "Оксана", "Юлия", "Ява", "Одесса", "Рико", "Алена", "Алёна", "Армения",
            "Валентина", "Вирджиния", "Надежда", "Саша", "Алания", "Аризона", "Голландия", "Дима", "Ирландия",
            "Рио", "Рома", "Самара", "Сидней", "Уфа", "Хьюстон", "Никита", "Александра", "Евгения", "Кристина",
            "Индиана", "Алина", "Настя", "Дели", "Канзас", "Любовь", "Альберта", "Санта", "Лариса", "Барселона",
            "Катя", "Дания", "Дарья", "Наташа", "Ксения", "Наталия", "Университета", "Оля", "Алма", "Эмилия",
            "Рейн", "Аня", "Юля", "Вера", "Нина", "Яна", "Ивано", "Кентукки", "Женя", "Невада", "Таня", "Инна",
            "Кения", "Юта", "Валерия", "Олеся", "Диана", "Атланта", "Алла", "Ленина", "Саха", "Маша", "Даша",
            "Бостон", "Полина", "Лилия", "Валенсия", "Карина", "Вероника", "Света", "Миша", "Карелия",
            "Тамара", "Азия", "Вика", "Маргарита", "Гана", "Катерина", "Лена", "Европа", "Эль", "Елизавета",
            "Лима", "Филадельфия", "Жанна", "Лидия", "Лиза", "Александрия", "Кострома", "Сербия", "Ксюша",
            "белая", "Анюта", "слава", "Шри", "Ангелина", "Рика", "Паша", "Алиса", "Дакота", "Рига", "Лера"            ,
            "Ниу", "Севилья", "Альбина", "Ланка", "София", "Ира", "Бали", "Химико", "Петра", "Эльвира",
            "Анжелика", "Катарина", "Кали", "Мир", "Сицилия", "Натали", "Арина", "Ким", "Надя", "Бай", "Маи",
            "Мар", "Аделаида", "Ран", "Анжела", "Антонина", "Тринидад", "Монтана", "Катюша", "Кызыл", "Роза",
            "Женева", "Ника", "Зоя", "Кузьмина", "Люба", "Дела", "Раиса", "Девон", "Ульяна", "Адана", "Кира",
            "Лида", "Соня", "Софья", "Аленка", "Алёнка", "Дина", "Бруклин", "Рона", "Хуан", "Айгуль", "Динара",
            "Леся", "Регина", "Люда", "Гульнара", "Ивана", "Галя", "Герцена", "Мадина", "Труда", "Сьерра",
            "Кале", "Тобаго", "Валя", "Настёна", "Венеция", "Настена", "Алия", "Ильина", "Рита", "Эльмира",
            "Алеся", "Ярослава", "Катюшка", "Мерида", "Ева", "Виолетта", "Марта", "Бар", "Кас", "Лара", "Влада",
            "Лори", "Зинаида", "Ида", "Лиля", "Снежана", "Феодосия", "Даня", "Римма", "Мади", "Милана", "Мира",
            "Элина", "Оленька", "Майя", "Мила", "Кара", "Ася", "Бреда", "Кут", "Спринг", "Шаркия",
            "Айгерим", "Албания", "Даля", "Зарина", "Инга", "Барбара", "Рота", "Вила", "Ангел", "Мами",
            "Дарина", "Бихар", "Венера", "Лина", "Ами", "Анечка", "Бат", "Олечка", "Светик", "Амина",
            "Астурия", "Верона", "Василиса", "Альфия", "Илона", "Маришка", "Саванна", "Лис", "Танка",
            "Айнур", "Лиана", "Артема", "Гузель", "Алевтина", "Элизабет", "Ван", "Варвара", "Наталя",
            "Нелли", "Гуля", "Фото", "Белен", "Вена", "Сабах", "Асель", "Рай", "Энн", "Дана", "Марианна",
            "Сабина", "Беверли", "Лагуна", "Меса", "Росарио", "Аврора", "Аида", "Пальма", "Ривер", "Шуя",
            "Алмаз", "Алсу", "Милена", "Витория", "Мэдисон", "Инта", "Клауд", "Анализа", "Армия", "Джулия",
            "Сонора", "Хайфа", "Ливия", "Флоренция", "Хана", "Юлька", "Гульназ", "Клара", "Кристи", "Лейла",
            "Савина", "Вита", "Эля", "Дашка", "Лана", "Олька", "Смела", "Айдана", "Камила", "Моника", "Канта",
            "Аля", "Ларина", "Настенька", "Поляна", "Сил", "Тюбе", "Долина", "Мари", "Таисия", "Маркса",
            "Юленька", "Инесса", "Руслана", "Мирослава", "Самая", "Фатима", "Ната", "Вида",
            "Санкт", "Йорк", "Техас", "Александр", "Сергей", "Андрей",
            "Киев", "Алексей", "Владимир", "Дмитрий", "Паулу", "Франс", "Вашингтон", "Лен", "Евгений",
            "Иван", "Игорь", "Лён", "Максим", "Николай", "Олег", "Париж", "Франциско", "Антон", "Артем",
            "Артём", "Виктор", "Денис", "Израиль", "Михаил", "Павел", "Роман", "Юрий", "Торонто", "Чили",
            "Илья", "Руслан", "Виталий", "Джерси", "Мельбурн", "Бич", "Дагестан", "Теннесси", "Уэст", "Вадим",
            "Кирилл", "Влад", "Луис", "Анатолий", "Диего", "Константин", "Василий", "Иран", "Ата", "Иванов",
            "Милан", "Вячеслав", "Макс", "Остин", "Артур", "Минас", "Валерий", "Берлин", "Марий", "Владислав",
            "Северо", "Леон", "Тула", "Вегас", "Улан", "Егор", "Данил", "Душанбе", "Орел", "Юра", "Корпус",
            "Колумбус", "Орландо", "Сантьяго", "Перт", "Вова", "Ваня", "Саня", "Баден", "Серёга", "Дом", "Вася",
            "Антонио", "Парк", "Фрунзе", "Гранд", "Даллас", "Коля", "Петр", "Пётр", "Хосе", "Костя", "Коста",
            "Тимур", "Род", "Геннадий", "Житомир", "Станислав", "Даниил", "Кинг", "Ола", "Осло", "Ричмонд",
            "Стас", "Лагос", "Валера", "Эдуард", "Борис", "Айленд", "Леонид", "Проф", "Майне", "Богдан", "Солт",
            "Сальвадор", "Ярослав", "Манила", "Армавир", "Каир", "Марат", "Рим", "Леха", "Лёха", "Питер",
            "Рустам", "Эссекс", "Рок", "Григорий", "Алекс", "Энгельс", "Георгий", "Дублин", "Алтай", "Дурбан",
            "Агу", "Панама", "Сомерсет", "Дел", "Кент", "Валентин", "Франко", "Таллин", "Мэн", "Зам", "Семен",
            "Семён", "Там", "Фёдор", "Кипр", "Федор", "Доминго", "Санто", "Виталик", "Детройт", "Милано",
            "Ринат", "Жека", "Крус", "Салават", "Леша", "Лёша", "Измит", "Степан", "Юрист", "Оман", "Хилл",
            "Златоуст", "Али", "Нор", "Худ", "Альберт", "Денвер", "Витя", "Джексон", "Авто", "Джамбул",
            "Куба", "Абик", "Линкольн", "Оксфорд", "Уинстон", "Азамат", "Олександр", "Боливар", "Сережа",
            "Серёжа", "Дейтон", "Анх", "Глеб", "Брайтон", "Никитин", "Тема", "Муз", "Салвадор", "Салон",
            "Давид", "Тёма", "Норт", "Данила", "Мемфис", "Ширак", "Батон", "Грин", "Джалал", "Кота",
            "Лестер", "Абу", "Марк", "Дорсет", "Рочестер", "Айдын", "Дамир", "Димон", "Толедо", "Мед",
            "Арсен", "Елец", "Кингстон", "Абад", "Аль", "Володимир", "Измаил", "Дус", "Петя", "Арт",
            "Бэй", "Матвей", "Лев", "Назар", "Тарас", "Берк", "Веллингтон", "Мороз", "Мак", "Омаха",
            "Володя", "Джамби", "Лансинг", "Ишим", "Ген", "Герман", "Уэйн", "Аркадий", "Рамиль", "Виталя",
            "Казы", "Милтон", "Авив", "Тимофей", "Пол", "Доцент", "Байконур", "Ислам", "Магомед", "Абердин",
            "Шамиль", "Маврикий", "Лёв", "Лонг", "Честер", "Арман", "Иванович", "Юджин", "Бей", "Сашка", "Шах",
            "Аслан", "Банда", "Йемен", "Кунгур", "Мировой", "Кан", "Роли", "Славик", "Гамильтон", "Король",
            "Балта", "Джордан", "Эдик", "Арсений", "Бари", "Жуан", "Лион", "Бенд", "Берген", "Крит", "Мат",
            "Аксай", "Апу", "Василь", "Гай", "Волк", "Адм", "Айдар", "Алик", "Гриша", "Мурат", "Гена",
            "светлый", "Ренат", "Берн", "Карлос", "Радик", "Дерби", "Жозе", "Юго", "Андрюха", "Булган",
            "Гран", "Сидар", "Так", "Тур", "Миха", "Сала", "Азат", "Алишер", "Данияр", "Джон", "Дон",
            "Строй", "Хай", "Владик", "Нурлан", "Эльдар", "Гора", "Пушкин", "Сер", "Арарат", "Педро",
            "Роберт", "Толик", "Трент", "Ден", "Рафаэль", "Серый", "Или", "Миллер", "Алам", "Монтгомери",
            "Сток"
    };

    static final String[] surNames = new String[]{ "Одесская", "Пермский", "Самарская", "Харьков", "Экономический", "Алания", "Александра", "Алтайский", "Валентина", "Воронежская", "Восточная", "Дели", "Денис", "Израиль", "Крым", "Лос", "Луганская", "Львовская", "Павел", "Париж", "Перу", "Роман", "Ростов", "Самара", "Саратовская", "Северный", "Харьковская", "Южная", "Юрий", "Антон", "Польша", "Уфа", "Приморский", "Запорожская", "Кристина", "Саратов", "Алина", "Львов", "Харьковский", "Директор", "Полтавская", "Влад", "Острова", "Винницкая", "Новая", "Тверская", "Нижний", "Хмельницкая", "Студент", "Костромская", "Большой", "Гомельская", "Канзас", "Белгородская", "Курская", "Житомирская", "Малышева", "Уральский", "Вологодская", "Бич", "Брянская", "Иванова", "Сумская", "Архангельская", "Тульская", "Хабаровский", "Владимирская", "Херсонская", "Николаевская", "Рейн", "Пензенская", "Константин", "Смоленская", "Манчестер", "Могилевская", "Ульяновская", "Ярославская", "Кривой", "Шевченко", "Рязанская", "Большая", "Леон", "Томская", "Витебская", "Рог", "Гродненская", "Астраханская", "Иванов", "Остин", "Липецкая", "Маша", "Франковская", "Эль", "Тамбовская", "Ломоносова", "Оренбург", "Тернопольская", "Милан", "Лас", "Ивановская", "Ленина", "Черкасская", "Смирнова", "Киров", "Дель", "Кузнецова", "Петрова", "Берлин", "Российский", "Калужская", "Пушкина", "Орловская", "Кот", "Курган", "Марий", "Попова", "Воинская", "Курганская", "Сибирский", "Курск", "Ровенская", "Николаев", "Черновицкая", "Астрахань", "Петербургский", "Черниговская", "Амурская", "Бурса", "Псковская", "Самарский", "Полина", "Волынская", "Юра", "Гессен", "Орел", "Марокко", "Бостон", "Карина", "Новгородская", "Корпус", "Кирова", "Ненецкий", "Вова", "Тамара", "Васильева", "Могилев", "Кадетский", "Николаева", "Ростовский", "Коста", "Великий", "Алексеева", "Тамбов", "Макарова", "Костя", "Полтава", "Петров", "Волкова", "Катерина", "Ульянова", "Антонио", "Горный", "Новикова", "Гамбург", "Саратовский", "Красный", "Бухгалтер", "Хмельницкий", "Павлова", "Грозный", "Александрия", "Морозова", "Воронежский", "Романова", "Федорова", "Фрунзе", "Томский", "Тунис", "Таун", "Майне", "Плеханова", "Род", "Мир", "Соколова", "Паша", "Мастер", "Завод", "Ангелина", "Кострома", "Калуга", "Главный", "Ровно", "Чернигов", "Белая", "Кузнецов", "Борис", "Смирнов", "Одесский", "Ричмонд", "Лебедева", "Порт", "Альбина", "Яковлева", "Андреева", "Языков", "Семенова", "Старый", "Рига", "Волжский", "Королева", "Басков", "Богдан", "Калинина", "Козлова", "Сергеева", "Марат", "Военный", "Питер", "Михайлова", "Пекин", "Финансов", "Ген", "Попов", "Королев", "Натали", "Сад", "Катарина", "Октябрьский", "Алекс", "Магазин", "Рок", "Степанова", "Раевская", "Франкфурт", "Старший", "Орлова", "Зайцева", "Арина", "Захарова", "Ран", "Васильев", "Егорова", "Учитель", "Ковалева", "Александров", "До", "Бондаренко", "Никитина", "Семенов", "Малая", "Энгельс", "Ким", "Коваленко", "Волков", "Роза", "Гагарина", "Из", "Сергеевич", "Куба", "Кравченко", "Александрович", "Борисов", "Кордова", "Подольский", "Белова", "Кельн", "Миронова", "Орловский", "Российская", "Тех", "Мекка", "Минский", "Максимова", "Франко", "Фролова", "Бристоль", "Антонина", "Григорьева", "Новиков", "Пензенский", "Валентин", "Морозов", "Ни", "Таллин", "Доктор", "Ткаченко", "Котова", "Семен", "Соколов", "Алиева", "Белый", "Борисова", "Групп", "Киселева", "Медведева", "Некрасова", "Николаевский", "Банк", "Ульяновский", "Воробьева", "Кузьмина", "Куйбышева", "Ви", "Санто", "Солнечный", "Чешская", "Казанский", "Сергеев", "Александрова", "Дел", "Жукова", "Ли", "Мэн", "Женева", "Сер", "Андреев", "Павлов", "Русский", "Тарасова", "Федоров", "Мельникова", "Михайлов", "Антонова", "Белгородский", "Бойко", "Макаренко", "Макаров", "Романов", "Городская", "Крус", "Лев", "Ярославский", "Владимирович", "Белорусский", "Морской", "Зам", "Ивановский", "Советский", "Сорокина", "Тульский", "Али", "Полякова", "Матвеева", "Мельник", "Павловский", "Степан", "Егоров", "Власова", "Рязанский", "Дмитриева", "Филиппова", "Нор", "Степанов", "Ирак", "Козлов", "Сидорова", "Дина", "Кузнецкий", "Титова", "Алексеев", "Комарова", "Механик", "Бару", "Жданова", "Ленинградский", "Беляева", "Львовский", "Экономическая", "Орджоникидзе", "Регина", "Демидова", "Бар", "Гончарова", "Курский", "Владимирский", "Пономарева", "Ученик", "Шугар", "Колесникова", "Каменец", "Носова", "Астраханский", "Савченко", "Хилл", "Зайцев", "Ильина", "Камышин", "Марченко", "Сергиев", "Турин", "Брянский", "Данилова", "Тверской", "Чернова", "Бай", "Богданова", "Исаева", "Карпова", "Куликова", "Алиев", "Баранова", "Ковров", "Серпухов", "Захаров", "Николаевич", "Осипова", "Южно", "Котов", "Крылова", "Мар", "Мечникова", "Смоленский", "Глеб", "Гурьев", "Донской", "Ковальчук", "Белов", "Волынский", "Давыдова", "Мак", "Абрамова", "Герасимова", "Калашникова", "Максимов", "Никитин", "Денисова", "Тель", "Тимофеева", "Юрист", "Бат", "Грин", "Давид", "Дамир", "Пирогова", "Фомина", "Виноградова", "Гусева", "Гусев", "Жуков", "Запорожский", "Матвеев", "Рудный", "Луганский", "Мальцева", "Остров", "Журавлева", "Люксембург", "Орлов", "Первомайский", "Ушакова", "Бор", "Казакова", "Кристи", "Маркова", "Петренко", "Серов", "Тамбовский", "Ковалев", "Соловьев", "Умань", "Антонов", "Афанасьева", "Балашов", "Дмитриев", "Красная", "Миронов", "Фролов", "Бандар", "Городской", "Курс", "Луки", "Магомедов", "Назарова", "Сокол", "Коваль", "Лебедев", "Филатова", "Лесной", "Руденко", "Тихонова", "Хаак", "Щербакова", "Каразина", "Коновалова", "Астафьева", "Ефимова", "Мирный", "Огарева", "Сидоров", "Вавилова", "Елец", "Каи", "Пара", "Савельева", "Тарасов", "Элина", "Воробьев", "Кара", "Мельников", "Салон", "Сибирская", "Бреда", "Бухарская", "Врач", "Джалал", "Ельцина", "Рота", "Федотова", "Винницкий", "Измаил", "Уфимский", "Яковлев", "Григорьев", "Климова", "Ленинский", "Наумова", "Данилов", "Ефремов", "Зарина", "Назар", "Бильбао", "Василенко", "Клименко", "Туполева", "Чайковский", "Глазов", "Ермакова", "Киселев", "Ку", "Кузьмин", "Матвей", "Самсун", "Сев", "Херсонский", "Шолохова", "Березовский", "Костромской", "Курганский", "Лазарева", "Лис", "Медведев", "Менделеева", "Павленко", "Гросу", "Ершова", "Мартынова", "Мороз", "Рыскулова", "Турецкий", "Черкасский", "Черных", "Чехов", "Гаврилов", "Гаврилова", "Голубева", "Жуковский", "Лысенко", "Марк", "Полтавский", "Шевчук", "Колесников", "Компаний", "Кут", "Маслова", "Сидоренко", "Воронина", "Горбачева", "Горбунова", "Ибрагимова", "Поляков", "Прокофьева", "Тарас", "Азов", "Светик", "Черниговский", "Ангел", "Викторович", "Дарина", "Евдокимова", "Камень", "Конго", "Краков", "Орда", "Строй", "Шамиль", "Ибрагимов", "Карпенко", "Класс", "Кудрявцева", "Назаров", "Потапова", "Самойлова", "Букетова", "Быкова", "Власов", "Карпов", "Коротченко", "Кульская", "Лина", "Липецкий", "Рай", "Супер", "Трофимова", "Денисов", "Емельянова", "Кадров", "Никифорова", "Романенко", "Сеченова", "Амина", "Арман", "Белоусова", "Берк", "Виноградов", "Гру", "Иванович", "Колян", "Логинова", "Магомедова", "Повар", "Полк", "Сорокин", "Анисимова", "Исаев", "Ислам", "Леонова", "Чехова", "Баранов", "Барбара", "Военная", "Ефремова", "Кия", "Клан", "Князева", "Левченко", "Литвинова", "Минина", "Овчинникова", "Сейфуллина", "Соболева", "Ян", "Герман", "Каз", "Клин", "Крымский", "Русская", "Уральская", "Ахметова", "Каримова", "Нестерова", "Пальма", "Ползунова", "Славик", "Бенд", "Гончаров", "Громова", "Дзержинский", "Петрович", "Советская", "Чкалова", "Алик", "Архипова", "Гуля", "Кутафина", "Славянский", "Дмитров", "Кириллова", "Куликов", "Прохорова", "Родионова", "Стаханов", "Троицкий", "Устинова", "Фабрика", "Башкирский", "Ильин", "Король", "Кузьменко", "Сабина", "Третьякова", "Фото", "Юрченко", "Балта", "Богданов", "Кинтана", "Мамедов", "Мирошниченко", "Пономарев", "Суворова", "Филиппов", "Харченко", "Арсений", "Бондарь", "Вольный", "Житомирский", "Иерусалимский", "Кропоткин", "Кубанский", "Олейник", "Осипов", "Петровский", "Посадский", "Пупкин", "Радик", "Савина", "Тимошенко", "Фомин", "Абрамов", "Классов", "Краснова", "Могилевский", "Мурат", "Так", "Титов", "Ахмедов", "Губкин", "Кинс", "Коломыя", "Лана", "Роо", "Тимофеев", "Фадеева", "Цветкова", "Чернов", "Юсупова", "Аксенова", "Ван", "Волк", "Воронова", "Гриша", "Гумилева", "Давыдов", "Каменский", "Комаров", "Ле", "Михайловский", "Моисеева", "Пак", "Плотникова", "Пономаренко", "Приходько", "Гатчина", "Заречный", "Ки", "Кондратьева", "Коновалов", "Конотоп", "Ларина", "Нежин", "Панова", "Булган", "Василь", "Витебский", "Гомельский", "Джордан", "Ершов", "Колесник", "Кулешова", "Панченко", "Светлый", "Симонова", "Ткачук", "Хайтс", "Юдина", "Андреевич", "Бей", "Беляев", "Гамильтон", "Гришина", "Жлобин", "Калужский", "Кириллов", "Кириченко", "Рябова", "Свердловский", "Свиридова", "Свободный", "Быков", "Гора", "Гордеева", "Гродненский", "Диман", "Журавлев", "Казаков", "Калинин", "Костенко", "Куйбышев", "Литвиненко", "Марков", "Машин", "Мировой", "Нестеренко", "Сафронова", "Тихонов", "Цюрих", "Александровский", "Амурский", "Герасимов", "Ефимов", "Зайка", "Каримов", "Михеева", "Речица", "Сми", "Юрьевич", "Яночка", "Альберт", "Бирюкова", "Вятский", "Губкина", "Дегтярева", "Демина", "Карлос", "Кравчук", "Мартынов", "Назаренко", "Октябрьская", "Тарасенко", "Токарева", "Алексеевич", "Гай", "Гран", "Днестровский", "Елисеева", "Казанцева", "Канаш", "Лада", "Любимова", "Мамедова", "Миллер", "Нарва", "Нестеров", "Ново", "Полищуk", "Полищук", "Пушкин", "Рустем", "Суворов", "Щербаков", "Авдеева", "Бобров", "Лозовая", "Мищенко", "Те", "Терещенко", "Тищенко", "Филатов", "Черный", "Шестакова", "Афанасьев", "Бари", "Берген", "Громов", "Короленко", "Лукьянова", "Наумов", "Саров", "Сафонова", "Селезнева", "Федотов", "Холод", "Шостка", "Аммосова", "Борисенко", "Гуз", "Кавказский", "Кан", "Крит", "Кутаис", "Лика", "Никулина", "Потапов", "Рыбинский", "Украинская", "Фром", "Харитонова", "Акимова", "Ваш", "Долина", "Игнатьева", "Касимов", "Кравцова", "Лобанова", "Магазина", "Мальцев", "Павловская", "Поле", "Пугачев", "Савельев", "Тернопольский", "Тимирязева", "Тур", "Узловая", "Черномырдина", "Юсупов", "Белград", "Глухов", "Горбунов", "Григорян", "Гусь", "Демченко", "Кадетская", "Кинель", "Киреева", "Климов", "Костина", "Мату", "Машерова", "Монако", "Печора", "Радченко", "Савчук", "Серый", "Фоменко", "Хасанова", "Художник", "Шухова", "Арсеньев", "Ахмед", "Бородина", "Кись", "Ковель", "Кожевникова", "Лазарев", "Никифоров", "Петербургская", "Серик", "Столыпина", "Сурат", "Федоренко", "Шах", "Благовещенский", "Будет", "Воронин", "Воронцова", "Галкина", "Голубев", "Державина", "Еремина", "Иващенко", "Катанова", "Майский", "Максименко", "Морская", "Овчинников", "Прокопенко", "Рафаэль", "Репина", "Скрябина", "Черная", "Чистякова", "Шаповалова", "Шарипова", "Яковенко", "Адам", "Балтийский", "Волочек", "Гончаренко", "Денисенко", "Дорог", "Ермаков", "Ключ", "Красногорский", "Лион", "Марсель", "Румянцева", "Саид"
    };

    static final String[] emails = new String[]{"@mail.ru", "@yandex.ru", "@rambler.ru", "@gmail.com", "@yahoo.com",};

    static final char[] chars = "1234567890qwertyuiopasdfghjklzxcvbnmQWERTYUIOPASDFGHJKLZXCVBNM".toCharArray();
    static final char[] digits = "1234567890".toCharArray();

    public Client getClient(){
        String name = getName();
        String surname = getSurname();

        Client client = new Client();
        client.setLogin(name + surname);
        client.setPassword(getPassword());
        client.setTelNumber(getTelNumber());
        client.setEmail(getEmail(name, surname));
        client.setBirthday(getBirthdate());
        return client;
    }

    private String getTelNumber() {
        String tel = "";
        for (int i = 0; i < 11; i++) {
            int temp = (int) Math.round(Math.random()*(digits.length-1));
            tel = tel + digits[temp];
        }
        return tel;
    }

    private String getPassword() {
        int passLen = (int) Math.round(Math.random()*4 + 6);
        String pass = "";
        for (int i = 0; i < passLen; i++) {
            pass = pass + chars[(int) (Math.random()*(chars.length-1))];
        }
        return pass;
    }

    private String getName(){
        int i = (int) Math.round(Math.random()*(names.length-1));
        String name = names[i];
        return name;
    }

    private String getSurname(){
        int i = (int) Math.round(Math.random()*(surNames.length-1));
        String surname = surNames[i];
        return surname;
    }

    private Date getBirthdate() {
        Long mil = Math.round(Math.random()*946080000000L);
        Date birthDate = new Date(mil);
        return birthDate;
    }

    private String getEmail(String name, String surname){
        int i = (int) Math.round(Math.random()*(emails.length-1));
        String email = name.substring(0,2) + surname.substring(0,2) + emails[i];
        return email;
    }


}
